---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.BorderAroundSchedule
source: html/4e87fd46-6762-6ec0-5bf9-896825205572.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.BorderAroundSchedule Property

Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet

## Syntax (C#)
```csharp
public ElementId BorderAroundSchedule { get; }
```